src/toir_cf/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_СоставИерархическихТехКартРемонтов/торо_СоставИерархическихТехКартРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоставИерархическихТехКартРемонтов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состав</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Catalogs/торо_ТехКарты/торо_ТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТехКарты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержитОпасныеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитРаботыПовышеннойОпасности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеРемонтаТребуетОстановаОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростоя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремениТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростояТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданаАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаЛев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаПрав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремениВСекундах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_ПараллельнойОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество работников данной квалификации необходимое для выполнения тех.операции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмеряемыеПоказатели</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МерыБезопасности</name>
    <attributes>
      <name>МераБезопасности</name>
      <type>
        <types>CatalogRef.торо_МерыБезопасности</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/CommonModules/торо_ТехнологическиеКарты/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Рассчитать продолжительность по операциям
//
// Параметры:
//		ВерсияТехКарты - СправочникОбъект.торо_ТехКарты - версия тех. карты ремонта.
//		ПоНормамТО - Булево - выполнять ли расчет по нормам ТО.
//
Процедура РассчитатьПродолжительностьПоОперациям(ВерсияТехКарты, ПоНормамТО = Ложь) Экспорт
	
	Продолжительность = 0;
	Продолжительность = РассчитатьПродолжительность(ВерсияТехКарты, ПоНормамТО);
	
	ТекстПродолжительности = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Продолжительность);
	
	ВерсияТехКарты.НормаВремени = Продолжительность;
	ВерсияТехКарты.НормаВремениТекст = ТекстПродолжительности;
	
КонецПроцедуры

// Процедура - Рассчитать продолжительность по трудозатратам.
//
// Параметры:
//		ВерсияТехКарты - СправочникОбъект.торо_ТехКарты - версия тех. карты ремонта.
//
Процедура РассчитатьПродолжительностьПоТрудозатратам(ВерсияТехКарты) Экспорт
	
	Продолжительность = РассчитатьПродолжительностьВложеннойТехКартыПоТрудозатратам(ВерсияТехКарты);
	
	ТекстПродолжительности = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Продолжительность);
	
	ВерсияТехКарты.НормаВремени = Продолжительность;
	ВерсияТехКарты.НормаВремениТекст = ТекстПродолжительности;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВерсииТехКартНаОдинУровеньВыше(ВерсияТехКарты) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты КАК ИдентификаторТехКарты
	|ПОМЕСТИТЬ ВТ_ИдентификаторТехКарты
	|ИЗ
	|	РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|ГДЕ
	|	торо_ВерсииТехКарт.ТехКарта = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СоставИерархическихТехКартРемонтов.ТехКарта КАК ТехКарта
	|ПОМЕСТИТЬ ВсеТехКартыВерхнегоУровня
	|ИЗ
	|	РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_СоставИерархическихТехКартРемонтов
	|ГДЕ
	|	торо_СоставИерархическихТехКартРемонтов.Состав = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеТехКартыВерхнегоУровня.ТехКарта КАК ТехКарта
	|ИЗ
	|	ВсеТехКартыВерхнегоУровня КАК ВсеТехКартыВерхнегоУровня
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторТехКарты КАК ВТ_ИдентификаторТехКарты
	|			ПО торо_ТехКартыСписокОпераций.Операция = ВТ_ИдентификаторТехКарты.ИдентификаторТехКарты
	|		ПО ВсеТехКартыВерхнегоУровня.ТехКарта = торо_ТехКартыСписокОпераций.Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ВерсияТехКарты);
	
	МассивВерсий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТехКарта");
	
	Возврат МассивВерсий;
	
КонецФункции

// Обновляет флаги наличия опасных операций в тех. карте при изменении флага в одной из вложенных операций.
//
// Параметры:
//		Выборка - ВыборкаИзРезульатаЗапрос - Выборка тех карт с полями ТехКарта, СодержитОпасныеОперации,
//						СодержитРаботыПовышеннойОпасности, ДатаПринятия. Должна сожержать только тех. карты,
//                непосредственно содержашие данную операцию. Остальные будут обновлены рекурсивно.
//		СодержитОпасныеОперации - Булево - признак опасной операции для текущей операции.
//		СодержитРаботыПовышеннойОпасности - Булево - признак работы повышенной опасности для текущей операции.
//
Процедура ОбновитьНаличиеОпасныхОперацийВТехКартах(ВыборкаТехКарт, СодержитОпасныеОперации, СодержитРаботыПовышеннойОпасности) Экспорт

	// Транзация не нужна, т.к. вызывается из тарнзакции записи тех. карты/тех. операции.
	
	Пока ВыборкаТехКарт.Следующий() Цикл
		ТехКартаОбъект = ВыборкаТехКарт.ТехКарта.ПолучитьОбъект();
		
		Если СодержитОпасныеОперации Тогда
			
			ТехКартаОбъект.СодержитОпасныеОперации = Истина;
			
		ИначеЕсли ВыборкаТехКарт.СодержитОпасныеОперации Тогда
			
			МассивОпераций = Новый Массив;
			Для каждого Стр Из ТехКартаОбъект.СписокОпераций Цикл
				МассивОпераций.Добавить(Стр.Операция);
			КонецЦикла; 
			
			ТехКартаОбъект.СодержитОпасныеОперации = ПроверитьНаличиеОпасныхОпераций(МассивОпераций, ВыборкаТехКарт.ДатаПринятия);
			
		КонецЕсли;
		
		Если СодержитРаботыПовышеннойОпасности Тогда
			
			ТехКартаОбъект.СодержитРаботыПовышеннойОпасности = Истина;
			
		ИначеЕсли ВыборкаТехКарт.СодержитРаботыПовышеннойОпасности Тогда
			
			МассивОпераций = Новый Массив;
			Для каждого Стр Из ТехКартаОбъект.СписокОпераций Цикл
				МассивОпераций.Добавить(Стр.Операция);
			КонецЦикла;
			
			ТехКартаОбъект.СодержитРаботыПовышеннойОпасности = ПроверитьНаличиеРаботПовышеннойОпасности(МассивОпераций, ВыборкаТехКарт.ДатаПринятия);
			
		КонецЕсли;
		
		ТехКартаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры	

Функция ПроверитьНаличиеОпасныхОпераций(Операции, ДатаПринятия) Экспорт
	
	флЕстьОпаснаяОперация = Ложь;
	
	Для каждого СтрокаМассива Из Операции Цикл
		Если ТипЗнч(СтрокаМассива) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			Если СтрокаМассива.Опасная Тогда
				флЕстьОпаснаяОперация = Истина;
				Прервать;
			КонецЕсли;
		Иначе
			ВерсияТК = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(СтрокаМассива, ДатаПринятия);
			Если ЗначениеЗаполнено(ВерсияТК) И ВерсияТК.СодержитОпасныеОперации Тогда
				флЕстьОпаснаяОперация = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат флЕстьОпаснаяОперация;
	
КонецФункции

Функция ПроверитьНаличиеРаботПовышеннойОпасности(Операции, ДатаПринятия) Экспорт
	
	флЕстьРаботаПовышеннойОпасности = Ложь;
	
	Для каждого СтрокаМассива Из Операции Цикл
		Если ТипЗнч(СтрокаМассива) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			Если СтрокаМассива.РаботаПовышеннойОпасности Тогда
				флЕстьРаботаПовышеннойОпасности = Истина;
				Прервать;
			КонецЕсли;
		Иначе
			ВерсияТК = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(СтрокаМассива, ДатаПринятия);
			Если ЗначениеЗаполнено(ВерсияТК) И ВерсияТК.СодержитРаботыПовышеннойОпасности Тогда
				флЕстьРаботаПовышеннойОпасности = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат флЕстьРаботаПовышеннойОпасности;
	
КонецФункции

#Область ПараллельноеВыполнениеТОТК

Процедура ДобавитьУсловноеОформлениеДляПараллельныхТОТК(Форма, ИмяЭлементаФорма = "ДеревоРемонтныхРабот", ИмяРеквизита = "ДеревоРемонтныхРабот") Экспорт
	
	Элемент = Форма.УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы[ИмяЭлементаФорма].Имя);
	
	Группа = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Группа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяРеквизита + ".ID_ПараллельнойОперации");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ID_ПараллельнойОперации");
	
	ОтборЭлемента = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяРеквизита + ".ID_ПараллельнойОперации");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

	Шрифт = Новый Шрифт(Форма.Элементы[ИмяЭлементаФорма].Шрифт,,, Истина);
    
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РассчитатьПродолжительностьВложеннойТехКартыПоТрудозатратам(ВерсияТехКарты)
	
	Продолжительность = 0;
	ОбработанныеПараллельныеОперации = Новый Соответствие();
	
	Для каждого СтрокаОпераций Из ВерсияТехКарты.СписокОпераций Цикл
		Если ЗначениеЗаполнено(СтрокаОпераций.ID_ПараллельнойОперации) Тогда
			Если Не ОбработанныеПараллельныеОперации[СтрокаОпераций.ID_ПараллельнойОперации] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОбработанныеПараллельныеОперации.Вставить(СтрокаОпераций.ID_ПараллельнойОперации, "");
			МаксимальнаяДлительность = 0;
			
			СтруктураПоиска = Новый Структура("ID_ПараллельнойОперации", СтрокаОпераций.ID_ПараллельнойОперации);
			МассивПараллельныхРабот = ВерсияТехКарты.СписокОпераций.НайтиСтроки(СтруктураПоиска);

			Для каждого НайденнаяСтрока Из МассивПараллельныхРабот Цикл
				Если ТипЗнч(НайденнаяСтрока.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
					ДатаСреза = ?(ЗначениеЗаполнено(ВерсияТехКарты.ДатаПринятия), ВерсияТехКарты.ДатаПринятия, ТекущаяДата());
					ОперацияТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(НайденнаяСтрока.Операция, ДатаСреза);
					Если Не ЗначениеЗаполнено(ОперацияТехКарта) Тогда
						Продолжить;
					КонецЕсли;
				
					МаксимальнаяДлительность = Макс(МаксимальнаяДлительность, РассчитатьПродолжительностьВложеннойТехКартыПоТрудозатратам(ОперацияТехКарта));
				Иначе
					СтруктураПоиска = Новый Структура("ID", НайденнаяСтрока.ID);
					НайденныеСтроки = ВерсияТехКарты.ТрудовыеЗатраты.НайтиСтроки(СтруктураПоиска);

					ПродолжительностьТО = 0;
					
					Для каждого СтрокаТЧ Из НайденныеСтроки Цикл
						 ПродолжительностьТО = ПродолжительностьТО + СтрокаТЧ.ВремяРаботы * СтрокаТЧ.Количество;
					КонецЦикла;
					 
					МаксимальнаяДлительность = Макс(МаксимальнаяДлительность, ПродолжительностьТО);
				КонецЕсли; 
			КонецЦикла; 
			
			Продолжительность = Продолжительность + МаксимальнаяДлительность;
		Иначе
			Если ТипЗнч(СтрокаОпераций.Операция) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
				СтруктураПоиска = Новый Структура("ID", СтрокаОпераций.ID);
				НайденныеСтроки = ВерсияТехКарты.ТрудовыеЗатраты.НайтиСтроки(СтруктураПоиска);

				Для каждого СтрокаТЧ Из НайденныеСтроки Цикл
					 Продолжительность = Продолжительность + СтрокаТЧ.ВремяРаботы * СтрокаТЧ.Количество;
				КонецЦикла;
			Иначе
				ДатаСреза = ?(ЗначениеЗаполнено(ВерсияТехКарты.ДатаПринятия), ВерсияТехКарты.ДатаПринятия, ТекущаяДата());
				ОперацияТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(СтрокаОпераций.Операция, ДатаСреза);
				Если Не ЗначениеЗаполнено(ОперацияТехКарта) Тогда
					Продолжить;
				КонецЕсли;
				
				Продолжительность = Продолжительность + РассчитатьПродолжительностьВложеннойТехКартыПоТрудозатратам(ОперацияТехКарта);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Продолжительность;
	
КонецФункции

Функция РассчитатьПродолжительность(ВерсияТехКарты, ПоНормамТО = Ложь)
	
	Продолжительность = 0;
	ОбработанныеПараллельныеОперации = Новый Соответствие();
	
	Для каждого СтрокаОпераций Из ВерсияТехКарты.СписокОпераций Цикл
		Если ЗначениеЗаполнено(СтрокаОпераций.ID_ПараллельнойОперации) Тогда
			Если Не ОбработанныеПараллельныеОперации[СтрокаОпераций.ID_ПараллельнойОперации] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОбработанныеПараллельныеОперации.Вставить(СтрокаОпераций.ID_ПараллельнойОперации, "");
			МаксимальнаяДлительность = 0;
			
			СтруктураПоиска = Новый Структура("ID_ПараллельнойОперации", СтрокаОпераций.ID_ПараллельнойОперации);
			МассивПараллельныхРабот = ВерсияТехКарты.СписокОпераций.НайтиСтроки(СтруктураПоиска);

			Для каждого НайдСтрока Из МассивПараллельныхРабот Цикл
				Если ТипЗнч(НайдСтрока.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
					ДатаСреза = ?(ЗначениеЗаполнено(ВерсияТехКарты.ДатаПринятия), ВерсияТехКарты.ДатаПринятия, ТекущаяДата());
					ОперацияТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(НайдСтрока.Операция, ДатаСреза);
					
					МаксимальнаяДлительность = Макс(МаксимальнаяДлительность, ?(ПоНормамТО, ОперацияТехКарта.НормаВремени, НайдСтрока.НормаВремениВСекундах) * НайдСтрока.Количество);
				Иначе
					МаксимальнаяДлительность = Макс(МаксимальнаяДлительность, ?(ПоНормамТО, НайдСтрока.Операция.НормаВремени, НайдСтрока.НормаВремениВСекундах) * НайдСтрока.Количество);
				КонецЕсли; 
			КонецЦикла; 
			
			Продолжительность = Продолжительность + МаксимальнаяДлительность;
		Иначе
			Если ТипЗнч(СтрокаОпераций.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				ДатаСреза = ?(ЗначениеЗаполнено(ВерсияТехКарты.ДатаПринятия), ВерсияТехКарты.ДатаПринятия, ТекущаяДата());
				ВложеннаяТК = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(СтрокаОпераций.Операция, ДатаСреза);
				Если Не ЗначениеЗаполнено(ВложеннаяТК) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			
			Продолжительность = Продолжительность + ?(ТипЗнч(СтрокаОпераций.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт")
													, ?(ПоНормамТО, ВложеннаяТК.НормаВремени, СтрокаОпераций.НормаВремениВСекундах) * СтрокаОпераций.Количество
													, ?(ПоНормамТО, СтрокаОпераций.Операция.НормаВремени, СтрокаОпераций.НормаВремениВСекундах) * СтрокаОпераций.Количество);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Продолжительность;
	
КонецФункции

#КонецОбласти
